# Pandas Apply

apply를 사용해서 연월일의 정보에서 연도만 빼보는 예제입니다.

In [2]:
import pandas as pd

In [3]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [8]:
def extract_year(column):
    return column.split('-')[0]

In [9]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [10]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [11]:
def get_age(year, current_year):
    return current_year - int(year)

In [14]:
df['age'] = df['year'].apply(get_age, current_year=2018)

In [15]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

In [18]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [19]:
df['introduce'] = df['age'].apply(get_introduce, prefix='I am', suffix=' years old')
df

   yyyy-mm-dd  year  age         introduce
0  2000-06-27  2000   18  I am18 years old
1  2002-09-24  2002   16  I am16 years old
2  2005-12-20  2005   13  I am13 years old

In [20]:
def get_introduce2(row):
    return "I am born in " + str(row.year) + " my age is " + str(row.age)

In [21]:
df['introduce'] = df.apply(get_introduce2, axis=1)

In [23]:
df.introduce = df.apply(get_introduce2, axis=1)

In [24]:
df

   yyyy-mm-dd  year  age                       introduce
0  2000-06-27  2000   18  I am born in 2000 my age is 18
1  2002-09-24  2002   16  I am born in 2002 my age is 16
2  2005-12-20  2005   13  I am born in 2005 my age is 13